app/views/roulettes/swap.html.erb

      <td >
        <%= collection_select(:pair, "[#{@counter}][member1]", Member.all,:id,:name, {selected: p.members[0]}, { onchange: "change_member(#{p.members[0]}, 'pair_[#{@counter}][member1]')" }) %>
---
SELECT "members".* FROM "members"