app/views/pairs/_form.html.erb

SELECT "members".* FROM "members"
---
    <div class="col-lg-10">
      <%= f.collection_select(:member1, Member.all, :id, :name) %>