app/controllers/coba_controller.rb

SELECT  "members".* FROM "members" LIMIT 1
SELECT COUNT(*) FROM "members"
---
  def roulette
    @member = Member.all
    @total  = @member.count

UPDATE "pairs" SET "status" = 'done'
INSERT INTO "pairs" ("members", "details", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["members", "{4,40}"], ["details", ""], ["status", "active"], ["created_at", "2015-12-17 07:51:39.498107"], ["updated_at", "2015-12-17 07:51:39.498107"]]
---
  def result
    @pairs = params[:pair]
    Pair.update_all status: "done"
    @pairs.each do |index, pair|
      new_pair = Pair.new
      new_pair.members = pair[:member1], pair[:member2]
      new_pair.details = pair[:details]
      new_pair.status = "active"
      new_pair.save