app/controllers/pairs_controller.rb

SELECT "pairs".* FROM "pairs"
---
  def index
    @pairs = Pair.all

INSERT INTO "pairs" ("details", "members", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["details", "ngepel"], ["members", "{NULL,NULL}"], ["created_at", "2015-12-15 06:33:16.054435"], ["updated_at", "2015-12-15 06:33:16.054435"]]
---
  def create
    @pair = Pair.new(pair_params)
    puts pair_params
    @pair.members = pair_params[:member1], pair_params[:member2]
    respond_to do |format|
      if @pair.save

UPDATE "pairs" SET "members" = $1, "details" = $2, "updated_at" = $3 WHERE "pairs"."id" = $4  [["members", "{1,1}"], ["details", "create views"], ["updated_at", "2015-12-16 03:09:20.188007"], ["id", 43]]
---
  def update
    @pair.members = pair_params[:member1], pair_params[:member2]
    respond_to do |format|
      if @pair.update(pair_params)

DELETE FROM "pairs" WHERE "pairs"."id" = $1  [["id", 2]]
---
  def destroy
    @pair.destroy

SELECT "members".* FROM "members"  ORDER BY name ASC
SELECT "pairs".* FROM "pairs"
---
  def roulette
    @member1 = Member.all.by_name
    @member2 = Member.all.by_name
    @pairs = Pair.all

SELECT "pairs".* FROM "pairs" WHERE "pairs"."members" = $1  [["members", "{40, 1}"]]
SELECT  "members".* FROM "members" WHERE "members"."id" = $1 LIMIT 1  [["id", 1]]
---
  def history
    members = "#{params[:members]}".delete("{").delete("}")
    members = members.split(",")
    @pairs = Pair.where("members=? OR members =?", "#{params[:members]}", "{#{members[1]},#{members[0]}}")
    @nama1 = Member.find(members[0]).name

SELECT  "pairs".* FROM "pairs" WHERE "pairs"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_pair
      @pair = Pair.find(params[:id])