app/controllers/roulettes_controller.rb

  def new
    @member = Member.all
    @total  = @member.count
---
SELECT "members".* FROM "members"
SELECT COUNT(*) FROM "members"

  def result
    @pairs = params[:pair]
    Pair.update_all status: "done"
    @pairs.each do |index, pair|
      new_pair = Pair.new
      new_pair.members = pair[:member1], pair[:member2]
      new_pair.details = pair[:details]
      new_pair.status = "active"
      new_pair.save
---
UPDATE "pairs" SET "status" = 'done'
INSERT INTO "pairs" ("members", "details", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["members", "{1,40}"], ["details", ""], ["status", "active"], ["created_at", "2015-12-17 08:20:57.492503"], ["updated_at", "2015-12-17 08:20:57.492503"]]

  def swap
    @pairs = Pair.where(status: "active")
---
SELECT  "pairs".* FROM "pairs" WHERE "pairs"."status" = $1 LIMIT 1  [["status", "active"]]